app/controllers/api/v1/feeds_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    friend_ids = @user.following.select(:id)
    sessions = SleepSession.completed.where(user_id: friend_ids).during_last_week.order(duration_sec: :desc, woke_at: :desc, id: :desc)
    render json: sessions.includes(:user).map { |s|