app/controllers/api/v1/follows_controller.rb

INSERT INTO "follows" ("follower_id", "followed_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["followed_id", 2], ["created_at", "2025-09-22 09:21:07.604727"], ["updated_at", "2025-09-22 09:21:07.604727"]]
---
      def create
        follow = Follow.new(follower_id: params[:user_id], followed_id: params[:followed_id])
        if follow.save

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."followed_id" = $2 LIMIT $3  [["follower_id", 1], ["followed_id", 2], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]
---
      def destroy
        follow = Follow.find_by(follower_id: params[:user_id], followed_id: params[:id])
        if follow
          follow.destroy