app/controllers/api/v1/sleep_sessions_controller.rb

SELECT 1 AS one FROM "sleep_sessions" WHERE "sleep_sessions"."user_id" = $1 AND "sleep_sessions"."woke_at" IS NULL LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "sleep_sessions" ("user_id", "slept_at", "woke_at", "duration_sec", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["slept_at", "2025-09-22 09:03:36.270922"], ["woke_at", nil], ["duration_sec", nil], ["created_at", "2025-09-22 09:03:36.274882"], ["updated_at", "2025-09-22 09:03:36.274882"]]
---
  def clock_in
    @user.with_lock do
      if @user.sleep_sessions.where(woke_at: nil).exists?
        return render json: { error: "already clocked in" }, status: :unprocessable_entity
      end
      session = @user.sleep_sessions.create!(slept_at: Time.current)

SELECT "sleep_sessions".* FROM "sleep_sessions" WHERE "sleep_sessions"."user_id" = $1 AND "sleep_sessions"."woke_at" IS NULL ORDER BY "sleep_sessions"."slept_at" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
UPDATE "sleep_sessions" SET "woke_at" = $1, "duration_sec" = $2, "updated_at" = $3 WHERE "sleep_sessions"."id" = $4  [["woke_at", "2025-09-22 09:14:17.214598"], ["duration_sec", 640], ["updated_at", "2025-09-22 09:14:17.214971"], ["id", 1]]
---
  def clock_out
    @user.with_lock do
      session = @user.sleep_sessions.where(woke_at: nil).order(:slept_at).last
      return render json: { error: "no open session" }, status: :unprocessable_entity unless session

      session.update!(woke_at: Time.current)

SELECT "sleep_sessions".* FROM "sleep_sessions" WHERE "sleep_sessions"."user_id" = $1 ORDER BY "sleep_sessions"."created_at" ASC  [["user_id", 1]]
---
  def index
    sessions = @user.sleep_sessions.order(:created_at)